export const GAME_TITLE = 'Пары';
export const HIDDEN_TITLE = 'Игра в пары';
export const GAME_DESCRIPTION = 'Вам предстоит сыграть в простую игру в пары';

export const RULES_TITLE = 'Правила игры';
export const RULES_TEXT_0 = 'Игрок видит квадратное поле из карточек, расположенных рубашкой вверх, и находит пары, открывая карточки в произвольном порядке. На открытых карточках могут быть картинки, буквы, цифры, пиктограммы. Игрок открывает сначала одну карточку, затем вторую. Если открытые карточки одинаковы, они остаются открытыми до конца партии. В противном случае они переворачиваются обратно.';
export const RULES_TEXT_START_TITLE = 'Начало игры';
export const RULES_TEXT_START_TEXT = 'На странице выводится поле, например, 4 × 4, из квадратных карточек. Каждая карточка содержит цифру. Пользователь не видит цифры — карточки расположены рубашкой вверх. На поле строго по две карточки с одинаковой цифрой, чтобы они могли образовать пару. Карточки расположены в случайном порядке.';
export const RULES_TEXT_GAME_PROGRESS_TITLE = 'Ход игры';
export const RULES_TEXT_GAME_PROGRESS_TEXT = 'Игрок может нажать на любую карточку. После нажатия карточка открывается — появляется цифра (карточка переворачивается). Далее игрок может открыть вторую карточку. Если открытые карточки содержат одинаковую цифру, они остаются открытыми до конца игры. Если вторая карточка содержит отличную от первой цифру, обе карточки закрываются, как только игрок откроет новую карточку. На поле остаются открытыми только найденные пары и 1-2 карточки, которые открывает игрок.';
export const RULES_TEXT_END_TITLE = 'Конец игры.';
export const RULES_TEXT_END_TEXT = 'Как только игрок открыл все пары на поле, игра считается завершённой.';
