export const GAME_TITLE = 'Пары';
export const HIDDEN_TITLE = 'Игра в пары';
export const GAME_DESCRIPTION = 'Вам предстоит сыграть в простую игру в пары';

export const RULES_TEXT_START_TITLE = 'Начало игры';
export const RULES_TEXT_START_TEXT = 'На странице выводится поле, например, 4 × 4, из карточек. Каждая карточка содержит цифру. Пользователь не видит цифры — карточки расположены рубашкой вверх. На поле строго по две карточки с одинаковой цифрой, чтобы они могли образовать пару. Карточки расположены в случайном порядке.';
export const RULES_TEXT_GAME_PROGRESS_TITLE = 'Ход игры';
export const RULES_TEXT_GAME_PROGRESS_TEXT = 'Игрок может нажать на любую карточку. После нажатия карточка открывается. Далее игрок может открыть вторую карточку. Если открытые карточки содержат одинаковую цифру, они остаются открытыми до конца игры. Если вторая карточка содержит отличную от первой цифру, обе карточки закрываются.';
export const RULES_TEXT_END_TITLE = 'Конец игры.';
export const RULES_TEXT_END_TEXT = 'Как только игрок открыл все пары на поле, игра считается завершённой.';

export const DEFAULT_PLAYING_FIELD_SIZE = 4;
